Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: You can’t set a symbolic reference outside of the refs style:
cs: Nelze však zadat symbolickou referenci mimo adresář refs:

source: You can’t stop the patching process with this script.
cs: Tímto skriptem nelze proces aplikace záplaty a zapsání revizí zastavit.

source: You can’t use partial globs in the pattern, so this would be invalid:
cs: Ve vzorci nelze použít částečné nahrazení, např. toto zadání by bylo neplatné:

source: You clone a repository with `git clone [url]`.
cs: Repozitář naklonujete příkazem `git clone [url]`.

source: You could calculate the differences between snapshots and provide only this data, but doing so is more complex — you may as well give Git all the data and let it figure it out.
cs: Mohli byste také vypočítat rozdíly mezi snímky a poskytnout pouze tato data. To je však o něco složitější. Stejně tak můžete systému Git zadat všechna data a přenechat výpočet na něm.

source: You created and switched to a branch, did some work on it, and then switched back to your main branch and did other work.
cs: Vytvořili jste novou větev, přepnuli jste na ni, provedli jste v ní změny a poté jste přepnuli zpět na hlavní větev, v níž jste rovněž provedli změny.

source: You did a few commits on them and deleted them directly after merging them into your main branch.
cs: Provedli jste v nich pár revizí a smazali jste je hned po začlenění změn do hlavní větve.

source: You do a commit, which takes the files as they are in the staging area and stores that snapshot permanently to your Git directory.
cs: Zapíšete revizi. Snímky souborů, uložené v oblasti připravených změn, se trvale uloží do adresáře Git.

source: You do not need root access, assuming Git, Perl, and an OpenSSH compatible SSH server are already installed.
cs: Pokud už jsou nainstalovány nástroje Git, Perl a SSH server kompatibilní s OpenSSH, nebudete potřebovat ani přístup root.

source: You do that by having Git compare the last commit on your topic branch with the first common ancestor it has with the master branch.
cs: Tohoto srovnání dosáhnete tak, že necháte Git porovnat poslední revizi ve vaší tematické větvi s prvním předkem, kterého má společného s hlavní větví.

source: You do this by running the `gitosis-init` command with your personal public key.
cs: Učiníte tak spuštěním příkazu `gitosis-init` se svým osobním veřejným klíčem.

source: You do this by telling Git how to convert your binary data to a text format that can be compared via the normal diff.
cs: Dosáhnete toho tím, že systému Git sdělíte, jak má konvertovat binární data do textového formátu, který lze zpracovávat běžným algoritmem pro zjišťování rozdílů (diff).

source: You do this with the `git branch` command:
cs: Učiníte tak příkazem `git branch`:

source: You do this with the `git merge` command:
cs: Učiníte tak příkazem `git merge`:

source: You do want to start including README, so let’s start tracking the file.
cs: Vy si ale přejete soubor README zahrnout, a proto ho začněme sledovat.

source: You don’t have to add all the extras, but you’ll probably want to include +svn in case you ever have to use Git with Subversion repositories (see Chapter 8).
cs: Není nutné přidávat všechny doplňky, ale pokud budete někdy používat Git s repozitáři systému Subversion, budete pravděpodobně chtít nainstalovat i doplněk +svn (viz kapitola 8).

source: You effectively change the order of those commits and remove the "added cat-file" commit completely.
cs: Jednoduše jste změnili pořadí těchto revizí a zároveň jste zcela odstranili revizi „added cat-file“.

source: You fetch them and merge the new remote branch into your work, making your history look something like Figure 3-37.
cs: Vy tyto změny vyzvednete a začleníte novou vzdálenou větev do své práce – vaše historie teď vypadá jako na obrázku 3-37.

source: You first add the Rack application to your project.
cs: Nejprve přidáte aplikaci Rack do svého projektu.

source: You get a clean summary of all the commits since v1.0.1, grouped by author, that you can e-mail to your list.
cs: Výstupem příkazu je čisté shrnutí všech revizí od v1.0.1, seskupené podle autora, kterého můžete přidat do e-mailu své konference.

source: You get a list of commits that have already been pushed up by running this:
cs: Seznam revizí, které už byly odeslány, získáte takto:

source: You get a list of new commits being pushed to your server with `git rev-list`.
cs: Příkazem `git rev-list` získáte výpis nových revizí odesílaných na váš server.

source: You get a reference to teamone’s master branch position locally.
cs: Lokálně získáte referenci na pozici hlavní větve serveru teamone.

source: You get an object back — that object is in loose format on the server, and you fetched it over a static HTTP GET request.
cs: Tímto postupem získáte jeden objekt. Ten je na serveru ve volném formátu a vy jste ho vyzvedli statickým požadavkem GET HTTP.

source: You go back to your code, and it turns out you can reproduce the issue, but you can’t figure out what is going wrong.
cs: Vrátíte se zpět ke svému kódu, a ukáže se, že dokážete problém reprodukovat, ne však identifikovat.

source: You hardcode the time zone (-0700) because doing so is easy.
cs: Časové pásmo definujete napevno (-0700), protože je to jednoduché.

source: You have a bona fide Git repository and a checkout or working copy of the files for that project.
cs: Nyní máte vytvořen opravdový gitový repozitář a pracovní kopii souborů k projektu (checkout).

source: You have a lot of options at this point.
cs: V tomto se nabízí celá řada možností.

source: You have a number of choices, so I’ll cover a few of them.
cs: Existuje hned několik možností. Na některé z nich se můžeme podívat.

source: You have several options to get a remote Git repository up and running so that you can collaborate with others or share your work.
cs: Existuje několik možností, jak vytvořit a zprovoznit vzdálený repozitář Git tak, abyste mohli spolupracovat s ostatními uživateli nebo sdílet svou práci.

source: You have three trees that specify the different snapshots of your project that you want to track, but the earlier problem remains: you must remember all three SHA-1 values in order to recall the snapshots.
cs: Máte vytvořeny tři stromy označující různé snímky vašeho projektu, jež chcete sledovat. Původního problému jsme se však stále nezbavili: musíte si pamatovat všechny tři hodnoty SHA-1, abyste mohli snímky znovu vyvolat.

source: You have to be careful, though, because the `.gitattributes` file is committed and passed around with the project but the driver (in this case, `dater`) isn’t; so, it won’t work everywhere.
cs: Přesto je na místě opatrnost. Soubor `.gitattributes` je zapisován a předáván spolu s projektem, avšak ovladač (v tomto případě je to `dater`) nikoli. Soubor tak nebude fungovat všude.

source: You have to change the path to the ACL file from this
cs: Cestu k souboru ACL budete muset změnit z

source: You have to do this every time you pull down a submodule change in the main project.
cs: To budete muset udělat pokaždé, když v hlavním projektu stáhnete změny v submodulu.

source: You have to either move it out of the way or remove it, in which case you have to clone it again when you switch back—and you may lose local changes or branches that you didn’t push up.
cs: Budete ho muset buď přemístit, nebo odstranit. V druhém případě ho budete muset znovu naklonovat, až přepnete zpět, navíc hrozí, že ztratíte lokální změny nebo větve, které jste neodeslali.

source: You have to figure out how to get the commit message from each of these commits to test.
cs: Budete muset najít postup, jak získat zprávy všech těchto revizí, které mají být otestovány.

source: You have to merge it manually into your work when you’re ready.
cs: Sloučení s vaší prací musíte udělat ručně, až to uznáte za vhodné.

source: You have to merge that work in at some point so you can keep up with the other developer in the future.
cs: Vy musíte tyto změny ve vhodném okamžiku začlenit do své práce, abyste do budoucna neztratili kontakt s ostatními vývojáři.

source: You have to move the `rack` submodule directory out of the way before you can switch to a branch that doesn’t have it:
cs: Nejprve budete muset přemístit adresář submodulu `rack`, než vám Git dovolí přepnout na větev, která adresář neobsahuje:

source: You have to push this data back to a Subversion server that can’t handle a commit that tracks more than one parent; so, after you push it up, it will look like a single commit that squashed in all the work of another branch under a single commit.
cs: Tato data budete muset odeslat zpět na server Subversion, který nedokáže pracovat s revizí sledující více než jednoho rodiče. Proto až je odešlete, budou vypadat jako jediná revize, jež zkomprimovala veškerou práci jiné větve do jedné revize.

source: You have to see who last changed the submodule:
cs: Musíte zjistit, kdo změnil submodul jako poslední:

source: You have to set it up.
cs: To budete muset nastavit.

source: You have to shell onto the server each time, and there is no access control — everyone in the file has read and write access to every project.
cs: Pokaždé se musíte přihlásit na server a k dispozici nemáte žádnou správu přístupu – všichni, kdo jsou uvedeni v souboru, mají ke každému projektu oprávnění pro čtení i pro zápis.

source: You have to unstage the `rack` directory first.
cs: Adresář `rack` už byl připraven k zapsání.

source: You have two nearly identical 4K objects on your disk.
cs: Na disku teď máte dva téměř identické 12kB objekty.

source: You have two remote servers: one named `gitserver` with a `master` branch; and another named `origin` with two branches, `master` and `testing`.
cs: Máte dva vzdálené servery: první nese označení `gitserver` a obsahuje větev `master`; druhý server je `origin`, který obsahuje větve `master` a`testing`.

source: You have your tree object, so you continue walking your commits.
cs: Stáhli jste objekt stromu, a můžete tak pokračovat v procházení revizí.

source: You just append them to your `authorized_keys` file:
cs: Vy nyní klíče přidáte do souboru `authorized_keys`:

source: You just switched back to your `master` branch, and you pull the `rack_branch` branch into the `rack` subdirectory of your `master` branch of your main project:
cs: Přepnuli jste zpět na větev `master` a větev `rack_branch` natáhnete do podadresáře `rack` své větve `master` hlavního projektu:

source: You know what the different workflows are, and you should have a pretty good grasp of fundamental Git usage.
cs: V tuto chvíli už znáte různé pracovní postupy a na velmi solidní úrovni byste měli ovládat základy systému Git.

source: You may also include a `log`, `tmp`, or `pid` directory; automatically generated documentation; and so on.
cs: Můžete rovněž přidat adresář `log`, `tmp` nebo `pid`, automaticky vygenerovanou dokumentaci a podobné.

source: You may also want to reduce the usual three lines context in diff output to only one line, as the context is now words, not lines.
cs: Možná byste také rádi zredukovali obvyklé třířádkové okolí změny na pouhý jeden řádek, protože chcete znát okolí slova a ne okolí řádku.

source: You may be wondering what the difference is between _author_ and _committer_.
cs: Možná se ptáte, jaký je rozdíl mezi _autorem_ a _autorem revize_.

source: You may even want to add a `pre-receive` hook that checks each commit message for a `git-svn-id` and rejects pushes that contain commits without it.
cs: Možná by nebylo od věci ani vytvořit zásuvný modul `pre-receive`, který by kontroloval všechny zprávy k revizím, zda obsahují `git-svn-id`, a odmítl by všechna odeslání, která obsahují revize bez něj.

source: You may have skipped to this chapter from a previous chapter, or you may have gotten here after reading the rest of the book — in either case, this is where you’ll go over the inner workings and implementation of Git.
cs: Ať už jste do této kapitoly přeskočili z některé z předchozích, nebo jste se sem pročetli napříč celou knihou, v této kapitole se dozvíte něco o vnitřním fungování a implementaci systému Git.

source: You may not want to run `adduser` and set temporary passwords for every user.
cs: Možná nebudete mít chuť spouštět příkaz `adduser` (přidat uživatele) a nastavovat pro každého uživatele dočasná hesla.

source: You may recall that when you ran `git init` earlier, you then ran `git add (files)` — that was to begin tracking files in your directory.
cs: Možná si vzpomínáte, že když jste před časem spustili příkaz `git init`, provedli jste potom příkaz `git add (soubory)`. Příkaz jste zadávali kvůli zahájení sledování souborů ve vašem adresáři.

source: You may see keys more than once, because Git reads the same key from different files (`/etc/gitconfig` and `~/.gitconfig`, for example).
cs: Některé klíče se mohou objevit vícekrát, protože Git načítá stejný klíč z různých souborů (například `/etc/gitconfig` a `~/.gitconfig`).

source: You may see some other files in there, but this is a fresh `git init` repository — it’s what you see by default.
cs: Možná ve svém adresáři najdete i další soubory. Toto je však příkazem `git init` čerstvě vytvořený repozitář s výchozím obsahem.

source: You may think to run this:
cs: Můžete zadat následující příkaz:

source: You may use it in conjunction with a commit template to programmatically insert information.
cs: Zásuvný modul můžete v kombinaci se šablonou revize využívat k vložení informací programem.

source: You may want to create an alias and effectively add a `stash-unapply` command to your Git.
cs: Můžete si také vytvořit alias a do svého gitu tím přidat příkaz `stash-unapply`.

source: You may want to dog-ear this page, because you’ll need that command, and you’ll likely forget the syntax.
cs: Na této stránce si možná chcete ohnout rožek, protože tento příkaz budete určitě potřebovat, ale jeho syntaxi pravděpodobně zapomenete.

source: You may want to use `rebase -i` to squash your work down to a single commit, or rearrange the work in the commits to make the patch easier for the maintainer to review — see Chapter 6 for more information about interactive rebasing.
cs: Možná budete chtít využít příkaz `rebase -i` a zkomprimovat svou práci do jediné revize nebo přeorganizovat práci v revizích tak, aby byla kontrola záplaty pro správce jednodušší – další informace o interaktivním přeskládání najdete v kapitole 6.

source: You merge in the same work again into a new merge commit.
cs: Znovu jste začlenili stejnou práci do nové revize sloučením.

source: You merged in what is basically a change to the pointer for your submodule; but it doesn’t update the code in the submodule directory, so it looks like you have a dirty state in your working directory:
cs: Začlenili jste něco, co je v podstatě změna ukazatele vašeho submodulu. Neaktualizovali jste tím však zdrojový kód v adresáři submodulu, takže to vypadá, jako že je váš pracovní adresář v chaotickém stavu:

source: You modify files in your working directory.
cs: Změníte soubory ve svém pracovním adresáři.

source: You must have Python and the `p4` tool installed on your machine for this import to work.
cs: Aby vám import fungoval, musíte mít v počítači nainstalován Python a nástroj `p4`.

source: You must have around 7,000 loose objects or more than 50 packfiles for Git to fire up a real gc command.
cs: Aby Git spustil skutečný příkaz gc, musíte mít kolem 7000 volných objektů nebo více než 50 balíčkových souborů.

source: You must indicate how far back you want to rewrite commits by telling the command which commit to rebase onto.
cs: Musíte specifikovat, jak hluboko do historie se chcete vrátit a přepisovat revize. K příkazu proto musíte zadat, na jakou revizi si přejete přeskládání provést.

source: You must look at each commit being pushed up, see if that string is in the commit message, and, if the string is absent from any of the commits, exit non-zero so the push is rejected.
cs: Každou odesílanou revizi si musíte prohlédnout, zjistit, zda zpráva k revizi obsahuje daný řetězec, a pokud v některé z nich chybí, vrátit nenulovou hodnotu, čímž odesílanou revizi odmítnete.

source: You must pass it the `--add` option because the file doesn’t yet exist in your staging area (you don’t even have a staging area set up yet) and `--cacheinfo` because the file you’re adding isn’t in your directory but is in your database.
cs: K příkazu je třeba zadat parametr `--add`, neboť tento soubor ve vaší oblasti připravených změn ještě neexistuje (dokonce ještě nemáte ani vytvořenou oblast připravených změn), a parametr `--cacheinfo`, protože soubor, který přidáváte, není ve vašem adresáři, je ale ve vaší databázi.

source: You must rewrite all the commits downstream from `6df76` to fully remove this file from your Git history.
cs: Chcete-li tento soubor kompletně odstranit z historie Git, budete muset přepsat všechny revize od `6df76` směrem dolů.

source: You must run two commands: `git submodule init` to initialize your local configuration file, and `git submodule update` to fetch all the data from that project and check out the appropriate commit listed in your superproject:
cs: Budete muset použít dva příkazy: `git submodule init` k inicializaci lokálního konfiguračního souboru a `git submodule update` k vyzvednutí všech dat z tohoto projektu a checkoutu příslušné revize uvedené ve vašem superprojektu:

source: You need a file in which you can store the SHA-1 value under a simple name so you can use that pointer rather than the raw SHA-1 value.
cs: Hodil by se soubor, do nějž budete pod jednoduchým názvem ukládat hodnotu SHA-1. Tento ukazatel pro vás bude srozumitelnější než nevlídná hodnota SHA-1.

source: You need an account on a Unix server of some kind.
cs: Budete potřebovat účet na nějakém unixovém serveru.

source: You need the signer’s public key in your keyring for this to work properly:
cs: Aby příkaz správně fungoval, musíte mít ve své klíčence veřejný klíč podepisujícího (signer).

source: You need to be careful to change only the e-mail addresses that are yours, so you use `--commit-filter`:
cs: Měli byste být opatrní, abyste změnili jen e-mailové adresy, které jsou opravdu vaše. Použijte proto parametr `--commit-filter`:

source: You need to be careful with this technique because amending changes the SHA-1 of the commit.
cs: Tady byste měli být opatrní, protože oprava revize změní také její hodnotu SHA-1.

source: You need to be sure your working directory is clean when you run this, though.
cs: Nezapomeňte však, že když příkaz spouštíte, je třeba, abyste měli čistý pracovní adresář.

source: You need to check out the `master` branch when you’ve completed the process.
cs: Po dokončení procesu tedy budete muset přepnout na větev `master`.

source: You need to do a bit of `post-import` cleanup.
cs: Po importu bude nutné data trochu vyčistit.

source: You need to edit the script so that it stops at the commit you want to edit.
cs: Skript je třeba upravit tak, aby zastavil na revizi, v níž chcete provést změny.

source: You need to find the latest commit SHA and then add a branch that points to it.
cs: Budete muset najít hodnotu SHA nejnovější revize a přidat větev, která na ni bude ukazovat.

source: You need to get rid of anything that has a pointer to those old commits before you repack:
cs: Před novým zabalením je třeba odstranit vše, co na tyto staré revize ukazuje:

source: You need to make some changes and commit snapshots of those changes into your repository each time the project reaches a state you want to record.
cs: Řekněme, že potřebujete udělat pár změn a zapsat snímky těchto změn do svého repozitáře pokaždé, kdy se projekt dostane do stavu, který chcete zaznamenat.

source: You need to push your work up to it.
cs: Do něj teď musíte odeslat svou práci.

source: You no longer have to manually create a bare repository for new projects on the server — Gitosis creates them automatically when it sees the first push:
cs: Od této chvíle už nebudete muset ručně vytvářet holé repozitáře pro nové projekty na serveru. Gitosis je vytvoří automaticky, jakmile zjistí první odeslání dat:

source: You now have a nice tarball and a zip archive of your project release that you can upload to your website or e-mail to people.
cs: Nyní máte vytvořen tarball a archiv zip k vydání svého projektu, které můžete nahrát na svou webovou stránku nebo rozeslat e-mailem.

source: You open it again and make that change, and you’re ready to commit.
cs: Soubor znovu otevřete, provedete změnu a chcete jej zapsat.

source: You preface everything with that.
cs: Takto začínají všechny příkazy.

source: You regularly push both of these branches to the public repository.
cs: Obě tyto větve pravidelně odesíláte do veřejného repozitáře.

source: You reuse the `export_data` method you defined earlier, because it’s the same as the way you specified your commit message data.
cs: Znovu tu využijete metodu `export_data`, kterou jste aplikovali před chvílí. Jedná se totiž o stejný způsob, jakým jste specifikovali data zprávy k revizi.

source: You run `print_export` inside each directory, which takes the manifest and mark of the previous snapshot and returns the manifest and mark of this one; that way, you can link them properly.
cs: V každém adresáři spustíte soubor `print_export`, který vezme manifest a známku předchozího snímku a poskytne manifest a označovač tohoto snímku. Tímto způsobem je lze řádně spojit.

source: You run your test again and find that this commit is broken, so you tell Git that with `git bisect bad`:
cs: Znovu provedete svůj test a zjistíte, že tato revize vykazuje chybu. Systému Git to tedy sdělíte příkazem `git bisect bad`:

source: You saw some simple Git configuration details in the first chapter, but I’ll go over them again quickly here.
cs: V první kapitole jste se seznámili s několika detaily konfigurace, ještě jednou bych se k nim ale rád v rychlosti vrátil.

source: You saw this in the last section with the `iss53` and `hotfix` branches you created.
cs: Viděli jste to v předchozí části, kdy jste si vytvořili větve `iss53` a `hotfix`.

source: You see how easy it is to take a Git repository, create a bare version, and place it on a server to which you and your collaborators have SSH access.
cs: Vidíte, jak je jednoduché vzít repozitář Git, vytvořit jeho holou verzi a umístit ji na server, k níž máte vy i vaši spolupracovníci SSH přístup.

source: You set up the information in that project; and when you push it, Gitosis reconfigures the server based on that, which is cool.
cs: V tomto projektu nastavíte všechny informace, a až ho odešlete, Gitosis překonfiguruje server, který je na něm založen. To je jistě příjemné řešení.

source: You should also be able to share your branches by pushing them to a shared server, working with others on shared branches and rebasing your branches before they are shared.
cs: Měli byste také umět odeslat své větve ke sdílení na server, spolupracovat s ostatními na sdílených větvích a před odesláním větve přeskládat.

source: You should also now have a working version of Git on your system that’s set up with your personal identity.
cs: Také byste nyní měli mít nainstalovanou fungující verzi systému Git, nastavenou na vaše osobní údaje.

source: You should also realize that this is a dangerous command: any changes you made to that file are gone — you just copied another file over it.
cs: Všimněte si také, že se jedná o nebezpečný příkaz. Veškeré změny, které jste v souboru provedli, jsou ztraceny, soubor jste právě překopírovali jiným souborem.
